from typing import final
from Token import *

GREETINGS_LIST: final = ['Привет', 'Приветствую', 'Рад видеть вас']
COLOR_CODES: final = [0xff9900, 0xFFF7ED, 0xffffff]
EMOJIS: final = ["🪨", "📜", "✂"]
REQUEST_CODES: final = [100, 101, 102, 103,
                        200, 201, 202, 203, 204, 206, 207,
                        300, 301, 302, 303, 304, 305, 307, 308,
                        400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410,
                        411, 412, 413, 414, 415, 416, 417, 418, 420,
                        421, 422, 423, 424, 425, 426, 429, 431, 444, 450, 451, 497,
                        498, 499, 500, 501, 502, 503, 504, 506, 507, 508, 509, 510,
                        511, 521, 522, 523, 525, 599]
SETTINGS: final = {'token': TOKEN, 'bot': Bot_name, 'id': Bot_ID, 'prefix': '|'}
